gemu2015/Sonoff-Tasmota/lib/lib_div/esp32-camera/driver/cam_hal.c
// Copyright 2010-2020 Espressif Systems (Shanghai) PTE LTD
//
// Licensed under the Apache License, Version 2.0 (the "License");
// you may not use this file except in compliance with the License.
// You may obtain a copy of the License at
//
//     http://www.apache.org/licenses/LICENSE-2.0
//
// Unless required by applicable law or agreed to in writing, software
// distributed under the License is distributed on an "AS IS" BASIS,
// WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
// See the License for the specific language governing permissions and
// limitations under the License.

#include <stdio.h>
#include <string.h>
#include <stdalign.h>
#include "esp_heap_caps.h"
#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
#include "ll_cam.h"
#include "cam_hal.h"

#if (ESP_IDF_VERSION_MAJOR == 3) && (ESP_IDF_VERSION_MINOR == 3)
#include "rom/ets_sys.h"
#else
#include "esp_timer.h"
#include "esp_cache.h"
#include "hal/cache_hal.h"
#include "hal/cache_ll.h"
#include "esp_idf_version.h"
#ifndef ESP_CACHE_MSYNC_FLAG_DIR_M2C
#define ESP_CACHE_MSYNC_FLAG_DIR_M2C 0
#endif
#if CONFIG_IDF_TARGET_ESP32
#include "esp32/rom/ets_sys.h"  // will be removed in idf v5.0
#elif CONFIG_IDF_TARGET_ESP32S2
#include "esp32s2/rom/ets_sys.h"
#elif CONFIG_IDF_TARGET_ESP32S3
#include "esp32s3/rom/ets_sys.h"
#endif
#endif // ESP_IDF_VERSION_MAJOR

#if CONFIG_LOG_DEFAULT_LEVEL_NONE
#define ESP_CAMERA_ETS_PRINTF(f, ...)
#else
#define ESP_CAMERA_ETS_PRINTF(f, ...) ets_printf(f, ##__VA_ARGS__)
#endif

#if CONFIG_CAMERA_TASK_STACK_SIZE
#define CAM_TASK_STACK             CONFIG_CAMERA_TASK_STACK_SIZE
#else
#define CAM_TASK_STACK             (4*1024)
#endif

static const char *TAG = "cam_hal";

// Tasmota AddLog integration — TcCamLog is a C-linkage wrapper defined in xdrv_124_tinyc_vm.h
// Define TC_CAM_DEBUG in build flags to enable verbose camera diagnostics
#if defined(TC_CAM_DEBUG) && defined(ARDUINO)
extern void TcCamLog(const char* fmt, ...);
#define TASM_LOG(fmt, ...) TcCamLog(fmt, ##__VA_ARGS__)
#else
#define TASM_LOG(fmt, ...) do {} while(0)
#define TcCamLog(fmt, ...) do {} while(0)
#endif
static cam_obj_t *cam_obj = NULL;
#if defined(CONFIG_CAMERA_PSRAM_DMA)
#define CAMERA_PSRAM_DMA_ENABLED CONFIG_CAMERA_PSRAM_DMA
#else
#define CAMERA_PSRAM_DMA_ENABLED 0
#endif

static volatile bool g_psram_dma_mode = CAMERA_PSRAM_DMA_ENABLED;
static portMUX_TYPE g_psram_dma_lock = portMUX_INITIALIZER_UNLOCKED;

/* At top of cam_hal.c – one switch for noisy ISR prints */
#ifndef CAM_LOG_SPAM_EVERY_FRAME
#define CAM_LOG_SPAM_EVERY_FRAME 0   /* set to 1 to restore old behaviour */
#endif

/* Number of bytes copied to SRAM for SOI validation when capturing
 * directly to PSRAM. Tunable to probe more of the frame start if needed. */
#ifndef CAM_SOI_PROBE_BYTES
#define CAM_SOI_PROBE_BYTES 32
#endif
/*
 * PSRAM DMA may bypass the CPU cache. Always call esp_cache_msync() on
 * PSRAM regions that the CPU will read so cached reads see the data written
 * by DMA.
 */

static inline size_t dcache_line_size(void)
{
#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 2, 0)
    /* cache_hal_get_cache_line_size() added extra argument from IDF 5.2 */
    return cache_hal_get_cache_line_size(CACHE_LL_LEVEL_EXT_MEM, CACHE_TYPE_DATA);
#else
    /* Older releases only expose the ROM helper, all current targets
     * have a 32‑byte DCache line */
    return 32;
#endif
}

/*
 * Invalidate CPU data cache lines that cover a region in PSRAM which
 * has just been written by DMA. This guarantees subsequent CPU reads
 * fetch the fresh data from PSRAM rather than stale cache contents.
 * Both address and length are aligned to the data cache line size.
 */
static inline void cam_drop_psram_cache(void *addr, size_t len)
{
    size_t line = dcache_line_size();
    if (line == 0) {
        line = 32; /* sane fallback */
    }
    uintptr_t start = (uintptr_t)addr & ~(line - 1);
    size_t sync_len = (len + ((uintptr_t)addr - start) + line - 1) & ~(line - 1);
    esp_cache_msync((void *)start, sync_len,
                    ESP_CACHE_MSYNC_FLAG_DIR_M2C | ESP_CACHE_MSYNC_FLAG_INVALIDATE);
}

/* Throttle repeated warnings printed from tight loops / ISRs.
 *
 * counter – static DRAM/IRAM uint16_t you pass in
 * first   – literal C string shown on first hit and as prefix of summaries
 */
#if CONFIG_LOG_DEFAULT_LEVEL >= 2
#define CAM_WARN_THROTTLE(counter, first)                                  \
    do {                                                                  \
        if (++(counter) == 1) {                                           \
            ESP_CAMERA_ETS_PRINTF(DRAM_STR("cam_hal: %s\r\n"), first);        \
        } else if ((counter) % 100 == 0) {                                \
            ESP_CAMERA_ETS_PRINTF(DRAM_STR("cam_hal: %s - 100 additional misses\r\n"), first); \
        }                                                                 \
        if ((counter) == 10000) (counter) = 1;                            \
    } while (0)
#else
#define CAM_WARN_THROTTLE(counter, first) do { (void)(counter); } while (0)
#endif

/* JPEG markers (byte-order independent). */
static const uint8_t JPEG_SOI_MARKER[] = {0xFF, 0xD8, 0xFF}; /* SOI = FF D8 FF */
#define JPEG_SOI_MARKER_LEN (3)
static const uint8_t JPEG_EOI_BYTES[] = {0xFF, 0xD9};        /* EOI = FF D9 */
#define JPEG_EOI_MARKER_LEN (2)

/* Compute the scan window for JPEG EOI detection in PSRAM.
 * The DMA block count can vary by ±1 between frames (sensor timing jitter),
 * so the EOI marker might be up to 2 DMA blocks from the end.
 * Use 4× half-buffer to give plenty of margin. */
static inline size_t eoi_probe_window(size_t half, size_t frame_len)
{
    size_t w = 4 * half + (JPEG_EOI_MARKER_LEN - 1);
    return w > frame_len ? frame_len : w;
}

static int cam_verify_jpeg_soi(const uint8_t *inbuf, uint32_t length)
{
    static uint16_t warn_soi_miss_cnt = 0;
    if (length < JPEG_SOI_MARKER_LEN) {
        CAM_WARN_THROTTLE(warn_soi_miss_cnt,
                          "NO-SOI - JPEG start marker missing (len < 3b)");
        return -1;
    }

    for (uint32_t i = 0; i <= length - JPEG_SOI_MARKER_LEN; i++) {
        if (memcmp(&inbuf[i], JPEG_SOI_MARKER, JPEG_SOI_MARKER_LEN) == 0) {
            //ESP_LOGW(TAG, "SOI: %d", (int) i);
            return i;
        }
    }

    CAM_WARN_THROTTLE(warn_soi_miss_cnt,
                      "NO-SOI - JPEG start marker missing");
    return -1;
}

