gemu2015/Sonoff-Tasmota/lib/lib_div/esp32-camera/driver/cam_hal.c
static int cam_verify_jpeg_eoi(const uint8_t *inbuf, uint32_t length, bool search_forward)
{
    if (length < JPEG_EOI_MARKER_LEN) {
        return -1;
    }

    if (search_forward) {
        /* Scan forward to honor the earliest marker in the buffer. This avoids
         * returning an EOI that belongs to a larger previous frame when the tail
         * of that frame still resides in PSRAM. JPEG data is pseudo random, so
         * the first marker byte appears rarely; test four positions per load to
         * reduce memory traffic. */
        const uint8_t *pat = JPEG_EOI_BYTES;
        const uint32_t A = pat[0] * 0x01010101u;
        const uint32_t ONE = 0x01010101u;
        const uint32_t HIGH = 0x80808080u;
        uint32_t i = 0;
        while (i + 4 <= length) {
            uint32_t w;
            memcpy(&w, inbuf + i, 4); /* unaligned load is allowed */
            uint32_t x = w ^ A; /* identify bytes equal to first marker byte */
            uint32_t m = (~x & (x - ONE)) & HIGH; /* mask has high bit set for candidate bytes */
            while (m) { /* handle only candidates to avoid unnecessary memcmp calls */
                unsigned off = __builtin_ctz(m) >> 3;
                uint32_t pos = i + off;
                if (pos + JPEG_EOI_MARKER_LEN <= length &&
                    memcmp(inbuf + pos, pat, JPEG_EOI_MARKER_LEN) == 0) {
                    return pos;
                }
                m &= m - 1; /* clear processed candidate */
            }
            i += 4;
        }
        for (; i + JPEG_EOI_MARKER_LEN <= length; i++) {
            if (memcmp(inbuf + i, pat, JPEG_EOI_MARKER_LEN) == 0) {
                return i;
            }
        }
        return -1;
    }

    const uint8_t *dptr = inbuf + length - JPEG_EOI_MARKER_LEN;
    while (dptr >= inbuf) {
        if (memcmp(dptr, JPEG_EOI_BYTES, JPEG_EOI_MARKER_LEN) == 0) {
            return dptr - inbuf;
        }
        if (dptr == inbuf) {
            break;
        }
        dptr--;
    }
    return -1;
}

static bool cam_get_next_frame(int * frame_pos)
{
    if(!cam_obj->frames[*frame_pos].en){
        for (int x = 0; x < cam_obj->frame_cnt; x++) {
            if (cam_obj->frames[x].en) {
                *frame_pos = x;
                return true;
            }
        }
    } else {
        return true;
    }
    return false;
}

static bool cam_start_frame(int * frame_pos)
{
    if (cam_get_next_frame(frame_pos)) {
        if(ll_cam_start(cam_obj, *frame_pos)){
            // Vsync the frame manually
            ll_cam_do_vsync(cam_obj);
            uint64_t us = (uint64_t)esp_timer_get_time();
            cam_obj->frames[*frame_pos].fb.timestamp.tv_sec = us / 1000000UL;
            cam_obj->frames[*frame_pos].fb.timestamp.tv_usec = us % 1000000UL;
            return true;
        }
    }
    return false;
}

void IRAM_ATTR ll_cam_send_event(cam_obj_t *cam, cam_event_t cam_event, BaseType_t * HPTaskAwoken)
{
    if (xQueueSendFromISR(cam->event_queue, (void *)&cam_event, HPTaskAwoken) != pdTRUE) {
        ll_cam_stop(cam);
        cam->state = CAM_STATE_IDLE;
#if CAM_LOG_SPAM_EVERY_FRAME
        ESP_DRAM_LOGD(TAG, "EV-%s-OVF", cam_event==CAM_IN_SUC_EOF_EVENT ? "EOF" : "VSYNC");
#else
        static uint16_t ovf_cnt = 0;
        CAM_WARN_THROTTLE(ovf_cnt,
                          cam_event==CAM_IN_SUC_EOF_EVENT ? "EV-EOF-OVF" : "EV-VSYNC-OVF");
#endif
    }
}

//Copy frame from DMA dma_buffer to frame dma_buffer
static void cam_task(void *arg)
{
    int cnt = 0;
    int frame_pos = 0;
    cam_obj->state = CAM_STATE_IDLE;
    cam_event_t cam_event = 0;

    xQueueReset(cam_obj->event_queue);

#ifdef TC_CAM_DEBUG
    static int dbg_task_cnt = 0;
#endif

    while (1) {
        xQueueReceive(cam_obj->event_queue, (void *)&cam_event, portMAX_DELAY);
        DBG_PIN_SET(1);
        switch (cam_obj->state) {

            case CAM_STATE_IDLE: {
                if (cam_event == CAM_VSYNC_EVENT) {
                    //DBG_PIN_SET(1);
                    if(cam_start_frame(&frame_pos)){
                        cam_obj->frames[frame_pos].fb.len = 0;
                        cam_obj->state = CAM_STATE_READ_BUF;
#ifdef TC_CAM_DEBUG
                        if (dbg_task_cnt < 20) {
                            TASM_LOG("cam_task: IDLE->READ fpos=%d en0=%d en1=%d", frame_pos,
                                cam_obj->frames[0].en, cam_obj->frames[1].en);
                        }
#endif
                    } else {
#ifdef TC_CAM_DEBUG
                        if (dbg_task_cnt < 20) {
                            TASM_LOG("cam_task: IDLE VSYNC no-free-buf en0=%d en1=%d",
                                cam_obj->frames[0].en, cam_obj->frames[1].en);
                        }
#endif
                    }
                    cnt = 0;
#ifdef TC_CAM_DEBUG
                    dbg_task_cnt++;
#endif
                }
            }
            break;

            case CAM_STATE_READ_BUF: {
                camera_fb_t * frame_buffer_event = &cam_obj->frames[frame_pos].fb;
                size_t pixels_per_dma = (cam_obj->dma_half_buffer_size * cam_obj->fb_bytes_per_pixel) / (cam_obj->dma_bytes_per_item * cam_obj->in_bytes_per_pixel);

                if (cam_event == CAM_IN_SUC_EOF_EVENT) {
                    if(!cam_obj->psram_mode){
                        if (cam_obj->fb_size < (frame_buffer_event->len + pixels_per_dma)) {
                            ESP_CAMERA_ETS_PRINTF(DRAM_STR("cam_hal: FB-OVF\r\n"));
                            ll_cam_stop(cam_obj);
                            continue;
                        }
                        frame_buffer_event->len += ll_cam_memcpy(cam_obj,
                            &frame_buffer_event->buf[frame_buffer_event->len],
                            &cam_obj->dma_buffer[(cnt % cam_obj->dma_half_buffer_cnt) * cam_obj->dma_half_buffer_size],
                            cam_obj->dma_half_buffer_size);
                    } else {
                        // stop if the next DMA copy would exceed the framebuffer slot
                        // size, since we're called only after the copy occurs
                        // This effectively reduces maximum usable frame buffer size
                        // by one DMA operation, as we can't predict here, if the next
                        // cam event will be a VSYNC
                        if (cnt + 1 >= cam_obj->frame_copy_cnt) {
                            ESP_CAMERA_ETS_PRINTF(DRAM_STR("cam_hal: DMA overflow\r\n"));
                            ll_cam_stop(cam_obj);
                            cam_obj->state = CAM_STATE_IDLE;
                            continue;
                        }
                    }

