gemu2015/Sonoff-Tasmota/lib/lib_div/esp32-camera/driver/cam_hal.c
    ll_cam_set_pin(cam_obj, config);
    ret = ll_cam_config(cam_obj, config);
    CAM_CHECK_GOTO(ret == ESP_OK, "ll_cam initialize failed", err);

#if CAMERA_DBG_PIN_ENABLE
    PIN_FUNC_SELECT(GPIO_PIN_MUX_REG[DBG_PIN_NUM], PIN_FUNC_GPIO);
    gpio_set_direction(DBG_PIN_NUM, GPIO_MODE_OUTPUT);
    gpio_set_pull_mode(DBG_PIN_NUM, GPIO_FLOATING);
#endif

    ESP_LOGI(TAG, "cam init ok");
    return ESP_OK;

err:
    free(cam_obj);
    cam_obj = NULL;
    return ESP_FAIL;
}

esp_err_t cam_config(const camera_config_t *config, framesize_t frame_size, uint16_t sensor_pid)
{
    CAM_CHECK(NULL != config, "config pointer is invalid", ESP_ERR_INVALID_ARG);
    esp_err_t ret = ESP_OK;

    ret = ll_cam_set_sample_mode(cam_obj, (pixformat_t)config->pixel_format, config->xclk_freq_hz, sensor_pid);
    CAM_CHECK_GOTO(ret == ESP_OK, "ll_cam_set_sample_mode failed", err);
    
    cam_obj->jpeg_mode = config->pixel_format == PIXFORMAT_JPEG;
#if CONFIG_IDF_TARGET_ESP32S2 || CONFIG_IDF_TARGET_ESP32S3
    cam_obj->psram_mode = g_psram_dma_mode;
#else
    cam_obj->psram_mode = false;
#endif
    ESP_LOGI(TAG, "PSRAM DMA mode %s", cam_obj->psram_mode ? "enabled" : "disabled");
    cam_obj->frame_cnt = config->fb_count;
    cam_obj->width = resolution[frame_size].width;
    cam_obj->height = resolution[frame_size].height;

    if(cam_obj->jpeg_mode){
#ifdef CONFIG_CAMERA_JPEG_MODE_FRAME_SIZE_AUTO
        cam_obj->recv_size = cam_obj->width * cam_obj->height / 5;
#else
        cam_obj->recv_size = CONFIG_CAMERA_JPEG_MODE_FRAME_SIZE;
#endif
        cam_obj->fb_size = cam_obj->recv_size;
    } else {
        cam_obj->recv_size = cam_obj->width * cam_obj->height * cam_obj->in_bytes_per_pixel;
        cam_obj->fb_size = cam_obj->width * cam_obj->height * cam_obj->fb_bytes_per_pixel;
    }

    ret = cam_dma_config(config);
    CAM_CHECK_GOTO(ret == ESP_OK, "cam_dma_config failed", err);

    size_t queue_size = cam_obj->dma_half_buffer_cnt - 1;
    if (queue_size == 0) {
        queue_size = 1;
    }
    cam_obj->event_queue = xQueueCreate(queue_size, sizeof(cam_event_t));
    CAM_CHECK_GOTO(cam_obj->event_queue != NULL, "event_queue create failed", err);

    size_t frame_buffer_queue_len = cam_obj->frame_cnt;
    if (config->grab_mode == CAMERA_GRAB_LATEST && cam_obj->frame_cnt > 1) {
        frame_buffer_queue_len = cam_obj->frame_cnt - 1;
    }
    cam_obj->frame_buffer_queue = xQueueCreate(frame_buffer_queue_len, sizeof(camera_fb_t*));
    CAM_CHECK_GOTO(cam_obj->frame_buffer_queue != NULL, "frame_buffer_queue create failed", err);

    ret = ll_cam_init_isr(cam_obj);
    CAM_CHECK_GOTO(ret == ESP_OK, "cam intr alloc failed", err);


#if CONFIG_CAMERA_CORE0
    xTaskCreatePinnedToCore(cam_task, "cam_task", CAM_TASK_STACK, NULL, configMAX_PRIORITIES - 2, &cam_obj->task_handle, 0);
#elif CONFIG_CAMERA_CORE1
    xTaskCreatePinnedToCore(cam_task, "cam_task", CAM_TASK_STACK, NULL, configMAX_PRIORITIES - 2, &cam_obj->task_handle, 1);
#else
    xTaskCreate(cam_task, "cam_task", CAM_TASK_STACK, NULL, configMAX_PRIORITIES - 2, &cam_obj->task_handle);
#endif

    ESP_LOGI(TAG, "cam config ok");
    return ESP_OK;

err:
    cam_deinit();
    return ESP_FAIL;
}

esp_err_t cam_deinit(void)
{
    if (!cam_obj) {
        return ESP_FAIL;
    }

    cam_stop();
    if (cam_obj->task_handle) {
        vTaskDelete(cam_obj->task_handle);
    }
    if (cam_obj->event_queue) {
        vQueueDelete(cam_obj->event_queue);
    }
    if (cam_obj->frame_buffer_queue) {
        vQueueDelete(cam_obj->frame_buffer_queue);
    }

    ll_cam_deinit(cam_obj);

    if (cam_obj->dma) {
        free(cam_obj->dma);
    }
    if (cam_obj->dma_buffer) {
        free(cam_obj->dma_buffer);
    }
    if (cam_obj->frames) {
        for (int x = 0; x < cam_obj->frame_cnt; x++) {
            free(cam_obj->frames[x].fb.buf - cam_obj->frames[x].fb_offset);
            if (cam_obj->frames[x].dma) {
                free(cam_obj->frames[x].dma);
            }
        }
        free(cam_obj->frames);
    }

    free(cam_obj);
    cam_obj = NULL;
    return ESP_OK;
}

void cam_stop(void)
{
    ll_cam_vsync_intr_enable(cam_obj, false);
    ll_cam_stop(cam_obj);
}

void cam_start(void)
{
    ll_cam_vsync_intr_enable(cam_obj, true);
}

camera_fb_t *cam_take(TickType_t timeout)
{
    camera_fb_t *dma_buffer = NULL;
#if CONFIG_IDF_TARGET_ESP32S3
    // On ESP32-S3, WiFi DMA can freeze the camera GDMA channel (issue #620).
    // cam_task captures frames normally, but they don't reach the queue (cause unknown).
    // Use a short initial timeout so recovery kicks in quickly.
    if (timeout > pdMS_TO_TICKS(200)) {
        timeout = pdMS_TO_TICKS(200);
    }
#endif
    const TickType_t start = xTaskGetTickCount();
#if CONFIG_IDF_TARGET_ESP32S3
    uint16_t dma_reset_counter = 0;
    static const uint8_t MAX_GDMA_RESETS = 3;
#else
    /* throttle repeated NULL frame warnings */
    static uint16_t warn_null_cnt = 0;
#endif
    /* throttle repeated NO-EOI warnings */
    static uint16_t warn_eoi_miss_cnt = 0;

    for (;;)
    {
        TickType_t elapsed = xTaskGetTickCount() - start; /* TickType_t is unsigned so rollover is safe */
        if (elapsed >= timeout) {
            ESP_LOGW(TAG, "Failed to get frame: timeout");
#if CONFIG_IDF_TARGET_ESP32S3
            {
                // On timeout, try GDMA reset + restart — WiFi can freeze GDMA (esp32-camera #620)
                ll_cam_dma_reset(cam_obj);
                cam_obj->state = CAM_STATE_IDLE;
                ll_cam_vsync_intr_enable(cam_obj, true);
                // Give it one more short chance after reset
                dma_buffer = NULL;
                if (xQueueReceive(cam_obj->frame_buffer_queue, (void *)&dma_buffer, pdMS_TO_TICKS(1000)) == pdTRUE && dma_buffer) {
                    goto got_frame;
                }
            }
#endif
            return NULL;
        }
        TickType_t remaining = timeout - elapsed;

#ifdef TC_CAM_DEBUG
        {
            static int dbg_recv_cnt = 0;
            if (dbg_recv_cnt < 30) {
                UBaseType_t qWaiting = uxQueueMessagesWaiting(cam_obj->frame_buffer_queue);
                TcCamLog("cam_take: fbq remaining=%u qLen=%u state=%d en0=%d en1=%d",
                    (unsigned)remaining, (unsigned)qWaiting, cam_obj->state,
                    cam_obj->frames[0].en, cam_obj->frames[1].en);
                dbg_recv_cnt++;
            }
        }
#endif

        if (xQueueReceive(cam_obj->frame_buffer_queue, (void *)&dma_buffer, remaining) == pdFALSE) {
#if CONFIG_IDF_TARGET_ESP32S3
            // Periodic GDMA reset during wait — WiFi may freeze GDMA at any time
            if (dma_reset_counter < MAX_GDMA_RESETS) {
                ll_cam_dma_reset(cam_obj);
                dma_reset_counter++;
            }
#endif
            continue;
        }

        if (!dma_buffer) {
            /* Work-around for ESP32-S3 GDMA freeze when Wi-Fi STA starts.
             * See esp32-camera commit 984999f (issue #620). */
#if CONFIG_IDF_TARGET_ESP32S3
            if (dma_reset_counter < MAX_GDMA_RESETS) {
                ll_cam_dma_reset(cam_obj);
                dma_reset_counter++;
                continue; /* retry with queue timeout */
            }
            if (dma_reset_counter == MAX_GDMA_RESETS) {
                ESP_CAMERA_ETS_PRINTF(DRAM_STR("cam_hal: Giving up GDMA reset after %u tries\r\n"),
                                     (unsigned) dma_reset_counter);
                dma_reset_counter++; /* suppress further logs */
            }
#else
            /* Early warning for misbehaving sensors on other chips */
            CAM_WARN_THROTTLE(warn_null_cnt,
                              "Unexpected NULL frame on " CONFIG_IDF_TARGET);
#endif
            vTaskDelay(1); /* immediate yield once resets are done */
            continue;             /* go to top of loop */
        }

    got_frame:
        if (cam_obj->jpeg_mode) {
            /* find the end marker for JPEG. Data after that can be discarded */
            int offset_e = -1;
            if (cam_obj->psram_mode) {
                // Invalidate entire frame buffer cache to ensure we see DMA-written data
                cam_drop_psram_cache(dma_buffer->buf, dma_buffer->len);

