gemu2015/Sonoff-Tasmota/lib/lib_div/esp32-camera/driver/cam_hal.c
                /* Search forward from (JPEG_EOI_MARKER_LEN - 1) bytes before the final
                 * DMA block. We prefer forward search to pick the earliest EOI in the
                 * last DMA node, avoiding stale markers from a larger prior frame. */
                size_t probe_len = eoi_probe_window(cam_obj->dma_node_buffer_size,
                                                   dma_buffer->len);
                if (probe_len < JPEG_EOI_MARKER_LEN) {
                    goto skip_eoi_check;
                }
                uint8_t *probe_start = dma_buffer->buf + dma_buffer->len - probe_len;
                int off = cam_verify_jpeg_eoi(probe_start, probe_len, true);
                if (off >= 0) {
                    offset_e = dma_buffer->len - probe_len + off;
                }
#ifdef TC_CAM_DEBUG
                if (off < 0) {
                    static int dbg_noeoi = 0;
                    if (dbg_noeoi++ < 20) {
                        uint8_t *end = dma_buffer->buf + dma_buffer->len;
                        TcCamLog("EOI-MISS: len=%d probe=%d hdr=%02x%02x tail=%02x%02x%02x%02x",
                            (int)dma_buffer->len, (int)probe_len,
                            dma_buffer->buf[0], dma_buffer->buf[1],
                            end[-4], end[-3], end[-2], end[-1]);
                    }
                }
#endif
            } else {
                offset_e = cam_verify_jpeg_eoi(dma_buffer->buf, dma_buffer->len, false);
            }

            if (offset_e >= 0) {
                size_t raw_len = dma_buffer->len;
                dma_buffer->len = offset_e + JPEG_EOI_MARKER_LEN;
                if (cam_obj->psram_mode) {
                    /* DMA may bypass cache, ensure full frame is visible */
                    cam_drop_psram_cache(dma_buffer->buf, dma_buffer->len);
                }
#ifdef TC_CAM_DEBUG
                {
                    static int dbg_eoi_cnt = 0;
                    if (dbg_eoi_cnt < 20) {
                        TASM_LOG("JPEG-EOI: raw=%d trim=%d eoi=%d buf=0x%08x",
                            (int)raw_len, (int)dma_buffer->len, offset_e, (unsigned)dma_buffer->buf);
                        dbg_eoi_cnt++;
                    }
                }
#endif
                return dma_buffer;
            }

skip_eoi_check:

            CAM_WARN_THROTTLE(warn_eoi_miss_cnt,
                              "NO-EOI - JPEG end marker missing");
            cam_give(dma_buffer);
            continue; /* wait for another frame */
        } else if (cam_obj->psram_mode &&
                   cam_obj->in_bytes_per_pixel != cam_obj->fb_bytes_per_pixel) {
            /* currently used only for YUV to GRAYSCALE */
            dma_buffer->len = ll_cam_memcpy(cam_obj, dma_buffer->buf, dma_buffer->buf, dma_buffer->len);
        }

        if (cam_obj->psram_mode) {
            /* DMA may bypass cache, ensure full frame is visible to the app */
            cam_drop_psram_cache(dma_buffer->buf, dma_buffer->len);
        }

        return dma_buffer;
    }
}

void cam_give(camera_fb_t *dma_buffer)
{
    for (int x = 0; x < cam_obj->frame_cnt; x++) {
        if (&cam_obj->frames[x].fb == dma_buffer) {
            cam_obj->frames[x].en = 1;
            break;
        }
    }
}

void cam_give_all(void) {
    for (int x = 0; x < cam_obj->frame_cnt; x++) {
        cam_obj->frames[x].en = 1;
    }
}

bool cam_get_available_frames(void)
{
    return 0 < uxQueueMessagesWaiting(cam_obj->frame_buffer_queue);
}

void cam_set_psram_mode(bool enable)
{
    portENTER_CRITICAL(&g_psram_dma_lock);
    g_psram_dma_mode = enable;
    portEXIT_CRITICAL(&g_psram_dma_lock);
}

bool cam_get_psram_mode(void)
{
    return g_psram_dma_mode;
}
